app/controllers/api/projects_controller.rb

SELECT  "projects".* FROM "projects" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
      def index
            #@projects = Project.all
            page_num=params[:page]
            @projects= Project.page(page_num)