app/controllers/api/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
        def index
          page_num=params[:page]
             @tasks = Task.page(page_num)