app/controllers/api/timesheets_controller.rb

SELECT  "timesheets".* FROM "timesheets" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."user_id" = ?  [["user_id", 2]]
---
def index
  page_num=params[:page]
  if current_user.isadmin
    @timesheets= Timesheet.page(page_num)
  elsif (current_user.is_project_lead || current_user.is_project_manager)
    @timesheets= Timesheet.joins(:project).where("projects.sbu = ? ", current_user.Sbu).page(page_num)
  else
    @timesheets= Timesheet.where("user_id = ? ",current_user.id).page(page_num)