app/controllers/api/users_controller.rb

  def index
    page_num=params[:page]
    @users= User.page(page_num)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]