app/views/tasks/index.html.erb

SELECT "tasks"."task_category" FROM "tasks"
---

  <% cat= Task.all.pluck(:task_category).uniq %>

SELECT "tasks".* FROM "tasks"
---
            <li class="list-group-item">
              <% mytimesheets= @timesheets.select{|a| a.task_id ==  task.id} %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 36], ["LIMIT", 1]]
---

              <% points= mytimesheets.collect{|a| a.timespent/60 * User.find(a.user_id).weight } %>