app/views/users/show.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 60], ["LIMIT", 1]]
---
    <tr>
      <td><a href="<%= project_path(Project.find(projection.project_id)) %>">