app/views/projects/show.html.erb

        <td>
            <% if (User.where(id: @project.project_lead).empty?) %>
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 36], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."id" = ?  [["id", 28]]

<% if (current_user.isadmin == true || current_user.ismanagement == true || current_user.is_project_manager== true || current_user.is_project_lead== true ) %>
    <% timesheets= Timesheet.select{|a| a.project_id == @project.id } %>
---
SELECT "timesheets".* FROM "timesheets"


<% cat= Task.all.pluck(:task_category).uniq %>
---
SELECT "tasks"."task_category" FROM "tasks"

          <li class="list-group-item">
            <% mytimesheets= @timesheets.select{|a| a.task_id ==  task.id} %>
---
SELECT "tasks".* FROM "tasks"