app/views/timesheets/index.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <tr>
      <td><%= Project.find(timesheet.project_id).projectname %></td>
      <td><%= Task.find(timesheet.task_id).taskname %></td>
      <td><%= User.find(timesheet.user_id).username %></td>