app/views/timesheets/new.html.erb

SELECT  "timesheets".* FROM "timesheets" WHERE (user_id = 1) ORDER BY "timesheets"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "timesheets" WHERE (user_id = 1)
---
  <div class="form-group">
        <% if(Timesheet.where(["user_id = ?", current_user.id]).empty?) %>

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                    <% @projects.each do |project| -%>
                      <%= content_tag(:option, Project.find(project.project_id).projectname, value: project.project_id) %>