app/views/timesheets/show.html.erb

<ol class="breadcrumb">
  <li><a href="<%= project_path(Project.find(@timesheet.project_id)) %>"><%= Project.find(@timesheet.project_id).projectname %></a></li>
  <li><a href="<%= tasks_path %>"><%= Task.find(@timesheet.task_id).taskname %></a></li>
  <li><%=User.find(@timesheet.user_id).username %></a></li>
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]