app/controllers/tasks_controller.rb

  def index
      #@tasks = Task.all
      @tasks = Task.all
      if (current_user.isadmin == true )
        @timesheets= Timesheet.all
      elsif (current_user.is_project_manager== true || current_user.is_project_lead== true )
        @timesheets= Timesheet.select{|a| current_user.id == Project.find(a.project_id).project_lead || current_user.id == Project.find(a.project_id).project_manager || current_user.id == a.user_id }
      else
        @timesheets= Timesheet.select{|a| a.user_id== current_user.id}
---
SELECT "tasks".* FROM "tasks"
SELECT "timesheets".* FROM "timesheets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 36], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def show
      @task = Task.find(params[:id])
      if (current_user.isadmin == true ||  current_user.is_project_manager== true || current_user.is_project_lead== true )
        @timesheets= Timesheet.all
      else
        @timesheets= Timesheet.select{|a| a.user_id== current_user.id}
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"

def update
  @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "taskname" = ?, "task_category" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["taskname", "RQ"], ["task_category", "Project Management"], ["updated_at", 2017-06-16 06:15:52 UTC], ["id", 1]]