app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."approved" = ? ORDER BY id DESC LIMIT ? OFFSET ?  [["approved", true], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."approved" = ?  [["approved", true]]
SELECT  "users".* FROM "users" WHERE "users"."Sbu" = ? ORDER BY id DESC LIMIT ? OFFSET ?  [["Sbu", "Mumbai"], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    if params[:status]
      if (params[:status] == 'all')
        @users = User.paginate(:page => params[:page]).order('id DESC')
      elsif (params[:status] == 'active')
        @users = User.where(:approved => true).paginate(:page => params[:page]).order('id DESC')
      elsif (params[:status] == 'inactive')
        @users = User.where(:approved => false).paginate(:page => params[:page]).order('id DESC')
      end
    else
      @users = User.paginate(:page => params[:page]).order('id DESC')
    end
    if params[:sbu]
      if (params[:sbu] == 'all')
        @users = User.paginate(:page => params[:page]).order('id DESC')
       # render json: @users
      else
        @users = User.where(:Sbu => params[:sbu] ).paginate(:page => params[:page]).order('id DESC')

SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 36], ["LIMIT", 1]]
UPDATE "users" SET "designation" = ?, "is_project_manager" = ?, "is_project_lead" = ?, "Sbu" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["designation", "Associate"], ["is_project_manager", true], ["is_project_lead", true], ["Sbu", "Singapore"], ["updated_at", 2017-09-05 13:00:03 UTC], ["id", 37]]
---
  def update
    @users = User.paginate(:page => params[:page])
    last_page = @users.total_pages
    #redirect_to: your_path(page: last_page)
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 36], ["LIMIT", 1]]
SELECT "projections".* FROM "projections"
SELECT "users".* FROM "users"
---
  def show
    @user = User.find(params[:id])
    @projections = Projection.select {|a| a.user_id == @user.id}