app/controllers/welcome_controller.rb

        end
        #         render json: @timesheets
      elsif (params[:project] == "0" && params[:designation] != "0" )
        @timesheets= Timesheet.select{|t| User.find(t.user_id).designation == params[:designation] }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 36], ["LIMIT", 1]]